RECORD_12-20-23_10.jmx.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 12-20-23 10.58.04 AM-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 12-20-23 10.58.04 AM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 12-20-23 10.58.04 AM-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1232,564)
      - go(edge://newtab/)
      - go(https://qavalidation.com/demo-form/)
      - clickByXPath(//input[@id=string(//label[text() = "Full Name(required)"])])
      - typeByXPath(//input[@id=string(//label[text() = "Full Name(required)"])]): "John doe"
      - clickByXPath(//input[@id=string(//label[text() = "Email(required)"])])
      - typeByXPath(//input[@id=string(//label[text() = "Email(required)"])]): "j@gmail.com"
      - clickByXPath(//input[@id=string(//label[text() = "Phone Number"])])
      - typeByXPath(//input[@id=string(//label[text() = "Phone Number"])]): "8765456789"
      - clickByCSS(span.ui-selectmenu-icon.ui-icon.ui-icon-triangle-1-s)
      - clickByXPath((//*[text() = "Female"])[2])
      - clickByXPath(//*[text() = "Female"])
      - clickByXPath((//*[text() = "Male"])[2])
      - clickByXPath(//input[@id=string(//label[text() = "3"])])
      - clickByXPath(//input[@id=string(//label[text() = "Functional testing"])])
      - clickByXPath(//input[@id=string(//label[text() = "Automation testing"])])
      - clickByXPath(//input[@id=string(//label[text() = "API testing"])])
      - clickByXPath(//*[text() = "Selenium"])
      - clickByXPath((//*[text() = "Selenium"])[5])
      - clickByXPath(//textarea[@id=string(//label[text() = "Other Details"])])
      - typeByXPath(//textarea[@id=string(//label[text() = "Other Details"])]): "None"
      - clickByXPath(//*[text() = "Submit!"])

  RECORD 12-20-23 10.58.04 AM-Http:
    headers:
      sec-ch-ua: '"Not_A Brand";v="8", "Chromium";v="120", "Microsoft Edge";v="120"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36 Edg/120.0.0.0'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://qavalidation.com/demo-form/'
            method: GET
            label: 'https://qavalidation.com/demo-form/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://qavalidation.com/demo-form/#contact-form-4072'
            method: POST
            label: 'https://qavalidation.com/demo-form/#contact-form-4072'
            think-time: 59712ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
            body:
              action: grunion-contact-form
              ak_hp_textarea: ''
              ak_js: '1703050090809'
              contact-form-hash: 875a4285a37d67e2416c29f39cb2425c0d8d255c
              contact-form-id: '4072'
              g4072-email: j@gmail.com
              g4072-fullname: John doe
              g4072-gender: Male
              g4072-otherdetails: None
              g4072-phonenumber: '8765456789'
              g4072-qatools: Selenium
              'g4072-skills[]': 'Functional testing,Automation testing,API testing'
              g4072-yearsofexperience: '3'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20231207
              st: env